status/2021/23apr21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-28 Sat 07:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>17 April 2021 - 23 April 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">17 April 2021 - 23 April 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org05bbe82">1. Santa Cruz Weather Station</a>
<ul>
<li><a href="#orgb496e6e">1.1. Next step</a>
<ul>
<li><a href="#org555173d">1.1.1. Order replacement sensor</a></li>
<li><a href="#orgb4451fa">1.1.2. Order Adafruit 4649</a></li>
<li><a href="#org27905dd">1.1.3. Clean BME680/VELM6075 boards</a></li>
<li><a href="#org921cf00">1.1.4. Design more robust instrument shelter</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org54d6b51">2. EPICS</a>
<ul>
<li><a href="#orgb02fa00">2.1. Next steps</a>
<ul>
<li><a href="#org922fb59">2.1.1. u3scpi network port testing</a></li>
<li><a href="#org377683f">2.1.2. initial EPICS interface</a></li>
<li><a href="#org488e31e">2.1.3. u3scpi analog/digital port reconfiguration.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf2bd3f4">3. Brini Tracker II</a>
<ul>
<li><a href="#orgcbbbdd1">3.1. Next steps</a>
<ul>
<li><a href="#org5ca15d9">3.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#org09c6af9">3.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#orgf83ac9b">3.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb6e9cd2">4. wktcolor</a>
<ul>
<li><a href="#org7bd8e2b">4.1. Coloring with igraph<sub>vertex</sub><sub>coloring</sub><sub>greedy</sub></a></li>
<li><a href="#org566f750">4.2. Saves output in GraphML format</a></li>
<li><a href="#org317e9c4">4.3. cleanup</a></li>
<li><a href="#org8c8c38c">4.4. graph simplification</a></li>
<li><a href="#org66a5378">4.5. smoke test</a></li>
<li><a href="#org54b1529">4.6. Next steps</a>
<ul>
<li><a href="#org23040b3">4.6.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf8831bc">5. wktplot</a>
<ul>
<li><a href="#orgd22ad7f">5.1. wktlib: c++ export.</a></li>
<li><a href="#orge5e72e6">5.2. wktplot: read wktcolor file to label polygons</a></li>
<li><a href="#orgd9cb25f">5.3. wktrand: add minimum distance parameter</a></li>
<li><a href="#org4312ec1">5.4. Next steps</a></li>
</ul>
</li>
<li><a href="#org3df27ff">6. ca-r</a>
<ul>
<li><a href="#orgcacd3df">6.1. Fixed: https://github.com/daniel-kelley/ca-r/issues/18</a></li>
<li><a href="#orgd5a687d">6.2. Next Step</a></li>
</ul>
</li>
<li><a href="#org1d60508">7. AMDGPU</a>
<ul>
<li><a href="#org1c4da83">7.1. Next steps</a>
<ul>
<li><a href="#orgc93218f">7.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge8cfff7">8. Ninja v Make</a>
<ul>
<li><a href="#org7dc027e">8.1. Next Step</a>
<ul>
<li><a href="#orgfa373d4">8.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org33788e2">9. Plumbing</a></li>
</ul>
</div>
</div>
<p>
A week of virus first and space seconds
</p>

<p>
First Moderna shot
Second Space X crew launch
Second Ingenuity flight
</p>

<div id="outline-container-org05bbe82" class="outline-2">
<h2 id="org05bbe82"><span class="section-number-2">1.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-1">
<p>
Test cable constructed
Test Jig program complete
Particle sensor dead
I2C sensors work but have significant corrosion
</p>
</div>
<div id="outline-container-orgb496e6e" class="outline-3">
<h3 id="orgb496e6e"><span class="section-number-3">1.1.</span> Next step</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org555173d" class="outline-4">
<h4 id="org555173d"><span class="section-number-4">1.1.1.</span> Order replacement sensor</h4>
</div>
<div id="outline-container-orgb4451fa" class="outline-4">
<h4 id="orgb4451fa"><span class="section-number-4">1.1.2.</span> Order Adafruit 4649</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Needs some more circutry (I2C A/D) and 555? but may be alternative
to Plantower sensor if it can be calibrated side by side.
</p>
</div>
</div>
<div id="outline-container-org27905dd" class="outline-4">
<h4 id="org27905dd"><span class="section-number-4">1.1.3.</span> Clean BME680/VELM6075 boards</h4>
</div>
<div id="outline-container-org921cf00" class="outline-4">
<h4 id="org921cf00"><span class="section-number-4">1.1.4.</span> Design more robust instrument shelter</h4>
</div>
</div>
</div>
<div id="outline-container-org54d6b51" class="outline-2">
<h2 id="org54d6b51"><span class="section-number-2">2.</span> EPICS</h2>
<div class="outline-text-2" id="text-2">
<p>
No progress. Now that the Brini Tracker A/D is working (which was
the original motivation for getting U3 stuff working), this is no
longer "critical path" - not like anything is critical in this list.
</p>
</div>
<div id="outline-container-orgb02fa00" class="outline-3">
<h3 id="orgb02fa00"><span class="section-number-3">2.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org922fb59" class="outline-4">
<h4 id="org922fb59"><span class="section-number-4">2.1.1.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-org377683f" class="outline-4">
<h4 id="org377683f"><span class="section-number-4">2.1.2.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-org488e31e" class="outline-4">
<h4 id="org488e31e"><span class="section-number-4">2.1.3.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
</div>
</div>
<div id="outline-container-orgf2bd3f4" class="outline-2">
<h2 id="orgf2bd3f4"><span class="section-number-2">3.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-3">
<p>
No progress
</p>
</div>
<div id="outline-container-orgcbbbdd1" class="outline-3">
<h3 id="orgcbbbdd1"><span class="section-number-3">3.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org5ca15d9" class="outline-4">
<h4 id="org5ca15d9"><span class="section-number-4">3.1.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-org09c6af9" class="outline-4">
<h4 id="org09c6af9"><span class="section-number-4">3.1.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-orgf83ac9b" class="outline-4">
<h4 id="orgf83ac9b"><span class="section-number-4">3.1.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>
<div id="outline-container-orgb6e9cd2" class="outline-2">
<h2 id="orgb6e9cd2"><span class="section-number-2">4.</span> wktcolor</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org7bd8e2b" class="outline-3">
<h3 id="org7bd8e2b"><span class="section-number-3">4.1.</span> Coloring with igraph<sub>vertex</sub><sub>coloring</sub><sub>greedy</sub></h3>
<div class="outline-text-3" id="text-4-1">
<p>
When the doc says "coloring is not necessarily minimal", it's true.
</p>
</div>
</div>
<div id="outline-container-org566f750" class="outline-3">
<h3 id="org566f750"><span class="section-number-3">4.2.</span> Saves output in GraphML format</h3>
</div>
<div id="outline-container-org317e9c4" class="outline-3">
<h3 id="org317e9c4"><span class="section-number-3">4.3.</span> cleanup</h3>
</div>
<div id="outline-container-org8c8c38c" class="outline-3">
<h3 id="org8c8c38c"><span class="section-number-3">4.4.</span> graph simplification</h3>
</div>
<div id="outline-container-org66a5378" class="outline-3">
<h3 id="org66a5378"><span class="section-number-3">4.5.</span> smoke test</h3>
</div>
<div id="outline-container-org54b1529" class="outline-3">
<h3 id="org54b1529"><span class="section-number-3">4.6.</span> Next steps</h3>
<div class="outline-text-3" id="text-4-6">
</div>
<div id="outline-container-org23040b3" class="outline-4">
<h4 id="org23040b3"><span class="section-number-4">4.6.1.</span> Explore how to get a minimal coloring</h4>
</div>
</div>
</div>
<div id="outline-container-orgf8831bc" class="outline-2">
<h2 id="orgf8831bc"><span class="section-number-2">5.</span> wktplot</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgd22ad7f" class="outline-3">
<h3 id="orgd22ad7f"><span class="section-number-3">5.1.</span> wktlib: c++ export.</h3>
</div>
<div id="outline-container-orge5e72e6" class="outline-3">
<h3 id="orge5e72e6"><span class="section-number-3">5.2.</span> wktplot: read wktcolor file to label polygons</h3>
</div>
<div id="outline-container-orgd9cb25f" class="outline-3">
<h3 id="orgd9cb25f"><span class="section-number-3">5.3.</span> wktrand: add minimum distance parameter</h3>
</div>

<div id="outline-container-org4312ec1" class="outline-3">
<h3 id="org4312ec1"><span class="section-number-3">5.4.</span> Next steps</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
</p>
</div>
</div>
</div>
<div id="outline-container-org3df27ff" class="outline-2">
<h2 id="org3df27ff"><span class="section-number-2">6.</span> ca-r</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgcacd3df" class="outline-3">
<h3 id="orgcacd3df"><span class="section-number-3">6.1.</span> Fixed: <a href="https://github.com/daniel-kelley/ca-r/issues/18">https://github.com/daniel-kelley/ca-r/issues/18</a></h3>
</div>
<div id="outline-container-orgd5a687d" class="outline-3">
<h3 id="orgd5a687d"><span class="section-number-3">6.2.</span> Next Step</h3>
<div class="outline-text-3" id="text-6-2">
<p>
None
</p>
</div>
</div>
</div>
<div id="outline-container-org1d60508" class="outline-2">
<h2 id="org1d60508"><span class="section-number-2">7.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org1c4da83" class="outline-3">
<h3 id="org1c4da83"><span class="section-number-3">7.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-orgc93218f" class="outline-4">
<h4 id="orgc93218f"><span class="section-number-4">7.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>
<div id="outline-container-orge8cfff7" class="outline-2">
<h2 id="orge8cfff7"><span class="section-number-2">8.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org7dc027e" class="outline-3">
<h3 id="org7dc027e"><span class="section-number-3">8.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-orgfa373d4" class="outline-4">
<h4 id="orgfa373d4"><span class="section-number-4">8.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>
<div id="outline-container-org33788e2" class="outline-2">
<h2 id="org33788e2"><span class="section-number-2">9.</span> Plumbing</h2>
<div class="outline-text-2" id="text-9">
<p>
Shower backed up but snaked it clean
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-01-28 Sat 07:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
